key = {'.-': 'а',
       '-...': 'б',
       '.--':'в',
       '--.':'г',
       '-..':'д',
       '.':'е',
       '...-':'ж',
       '--..':'з',
       '..':'и',
       '.---':'й',
       '-.-':'к',
       '.-..':'л',
       '--':'м',
       '-.':'н',
       '---':'о',
       '.--.':'п',
       '.-.':'р',
       '...':'с',
       '-':'т',
       '..-':'у',
       '..-.':'ф',
       '....':'х',
       '-.-.':'ц',
       '---.':'ч',
       '----':'ш',
       '--.-':'щ',
       '--.--':'ъ',
       '-.--':'ы',
       '-..-':'ь',
       '..-..':'э',
       '..--':'ю',
       '.-.-':'я'}

def decode(text):
       for i in range(min(6, len(text))):
              if i == len(text):
                     return key[text]
              else:
                     return key[text[:i]] + decode(text[i:])

print('Введите зашифрованное сообщение: ')
code = input()
print(decode(code))
